app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT * FROM "activities"

  def create
    @activity = Activity.new(params[:activity])
    if @activity.save
---
INSERT INTO "activities" ("name", "created_at", "updated_at") VALUES('roller ski', '2009-12-15 02:15:57', '2009-12-15 02:15:57')

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 4)

  def update
    @activity = Activity.find(params[:id])
    if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 4)
UPDATE "activities" SET "updated_at" = '2009-12-15 02:48:08', "name" = 'swimming' WHERE "id" = 1

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
DELETE FROM "activities" WHERE "id" = 1