app/controllers/sports_controller.rb

SELECT * FROM "sports"
---
  def index
    @sports = Sport.all

INSERT INTO "sports" ("name", "created_at", "updated_at") VALUES('Running', '2009-12-15 21:42:22', '2009-12-15 21:42:22')
---
  def create
    @sport = Sport.new(params[:sport])
    if @sport.save

SELECT * FROM "sports" WHERE ("sports"."id" = 1)
---
  def edit
    @sport = Sport.find(params[:id])

SELECT * FROM "sports" WHERE ("sports"."id" = 1)
UPDATE "sports" SET "updated_at" = '2009-12-15 21:57:35', "name" = 'Runnings' WHERE "id" = 3
---
  def update
    @sport = Sport.find(params[:id])
    if @sport.update_attributes(params[:sport])

SELECT * FROM "sports" WHERE ("sports"."id" = 3)
DELETE FROM "sports" WHERE "id" = 3
---
  def destroy
    @sport = Sport.find(params[:id])
    @sport.destroy